In [33]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns 

df = pd.read_csv("data/coffee_sales_1.csv")
df

,date,datetime,cash_type,card,money,coffee_name
0,2024-03-01,2024-03-01 10:15:50.520,card,ANON-0000-0000-0001,38.70,Latte
1,2024-03-01,2024-03-01 12:19:22.539,card,ANON-0000-0000-0002,38.70,Hot Chocolate
2,2024-03-01,2024-03-01 12:20:18.089,card,ANON-0000-0000-0002,38.70,Hot Chocolate
3,2024-03-01,2024-03-01 13:46:33.006,card,ANON-0000-0000-0003,28.90,Americano
4,2024-03-01,2024-03-01 13:48:14.626,card,ANON-0000-0000-0004,38.70,Latte
...,...,...,...,...,...,...
3631,2025-03-23,2025-03-23 10:34:54.894,card,ANON-0000-0000-1158,35.76,Cappuccino
3632,2025-03-23,2025-03-23 14:43:37.362,card,ANON-0000-0000-1315,35.76,Cocoa
3633,2025-03-23,2025-03-23 14:44:16.864,card,ANON-0000-0000-1315,35.76,Cocoa
3634,2025-03-23,2025-03-23 15:47:28.723,card,ANON-0000-0000-1316,25.96,Americano
3635,2025-03-23,2025-03-23 18:11:38.635,card,ANON-0000-0000-1275,35.76,Latte

In [34]:
df.shape
df.dtypes
#df.describe(include="all")

date            object
datetime        object
cash_type       object
card            object
money          float64
coffee_name     object
dtype: object

In [26]:
df = df.drop(columns=['date'])
df['datetime'] = pd.to_datetime(df['datetime'])
df.dtypes

datetime       datetime64[ns]
cash_type              object
card                   object
money                 float64
coffee_name            object
dtype: object

In [35]:
df['money'] = (df['money']/10).round(2)
df.tail(10)

,date,datetime,cash_type,card,money,coffee_name
3626,2025-03-22,2025-03-22 15:57:58.183,card,ANON-0000-0000-1302,2.11,Espresso
3627,2025-03-22,2025-03-22 16:26:59.766,card,ANON-0000-0000-1274,3.58,Latte
3628,2025-03-22,2025-03-22 17:53:35.942,card,ANON-0000-0000-1274,3.09,Americano with Milk
3629,2025-03-22,2025-03-22 19:16:52.727,card,ANON-0000-0000-1314,3.09,Americano with Milk
3630,2025-03-23,2025-03-23 10:07:11.278,card,ANON-0000-0000-1196,3.58,Latte
3631,2025-03-23,2025-03-23 10:34:54.894,card,ANON-0000-0000-1158,3.58,Cappuccino
3632,2025-03-23,2025-03-23 14:43:37.362,card,ANON-0000-0000-1315,3.58,Cocoa
3633,2025-03-23,2025-03-23 14:44:16.864,card,ANON-0000-0000-1315,3.58,Cocoa
3634,2025-03-23,2025-03-23 15:47:28.723,card,ANON-0000-0000-1316,2.60,Americano
3635,2025-03-23,2025-03-23 18:11:38.635,card,ANON-0000-0000-1275,3.58,Latte

In [20]:
df.coffee_name.unique()
df.card.unique()
df.card.value_counts()
df.cash_type.unique()

array(['card', 'cash'], dtype=object)

In [43]:
cash_df = df[df['cash_type'] == "cash"]
cash_df = cash_df.drop(['card','cash_type'], axis=1)

cash_df

           date                 datetime  money          coffee_name
12   2024-03-02  2024-03-02 10:30:35.668    4.0                Latte
18   2024-03-03  2024-03-03 10:10:43.981    4.0                Latte
41   2024-03-06  2024-03-06 12:30:27.089    3.5  Americano with Milk
46   2024-03-07  2024-03-07 10:08:58.945    4.0                Latte
49   2024-03-07  2024-03-07 11:25:43.977    4.0                Latte
..          ...                      ...    ...                  ...
657  2024-05-31  2024-05-31 09:23:58.791    3.9                Latte
677  2024-06-01  2024-06-01 20:54:59.267    3.9                Cocoa
685  2024-06-02  2024-06-02 22:43:10.636    3.4  Americano with Milk
691  2024-06-03  2024-06-03 21:42:51.734    3.4  Americano with Milk
692  2024-06-03  2024-06-03 21:43:37.471    3.4  Americano with Milk

[89 rows x 4 columns]